app/User.php

    public function hasPermission($section_name)
    {
        if (self::isAdmin()) {
            if (!isset($this->permissions)) {
                $sections_id = Permission::where('role_id', '=', $this->role_id)->where('allow', true)->pluck('section_id')->toArray();
---
select `section_id` from `permissions` where `role_id` = 2 and `allow` = 1

    public function getAccountingBalance()
    {
        $additions = Accounting::where('user_id', $this->id)
            ->where('type', Accounting::$addiction)
            ->where('system', false)
            ->where('tax', false)
            ->sum('amount');

        $deductions = Accounting::where('user_id', $this->id)
            ->where('type', Accounting::$deduction)
            ->where('system', false)
            ->where('tax', false)
            ->sum('amount');
---
select sum(`amount`) as aggregate from `accounting` where `user_id` = 1016 and `type` = 'addiction' and `system` = 0 and `tax` = 0
select sum(`amount`) as aggregate from `accounting` where `user_id` = 1016 and `type` = 'deduction' and `system` = 0 and `tax` = 0

    public function getUnReadNotifications()
    {
        $user = $this;

        $notifications = Notification::where(function ($query) {
            $query->where(function ($query) {
                $query->where('user_id', $this->id)
                    ->where('type', 'single');
            })->orWhere(function ($query) {
                if (!$this->isAdmin()) {
                    $query->whereNull('user_id')
                        ->whereNull('group_id')
                        ->where('type', 'all_users');
                }
            });
        })->doesntHave('notificationStatus')
            ->orderBy('created_at', 'desc')
            ->get();
---
select * from `notifications` where ((`user_id` = 1 and `type` = 'single')) and not exists (select * from `notifications_status` where `notifications`.`id` = `notifications_status`.`notification_id`) order by `created_at` desc

    public function getAllPurchasedWebinarsIds()
    {
        $userBoughtWebinarsIds = [];
        $userBoughtWebinars = Sale::query()->where('buyer_id', $this->id)
            ->whereNotNull('webinar_id')
            ->whereNull('refund_at')
            ->get();
---
select * from `sales` where `buyer_id` = 1 and `webinar_id` is not null and `refund_at` is null