<?php
return [
    'public' => [
        'retrieved' => 'داده باموفقیت بازیابی شد.',
        'stored' => 'این آیتم باموفقیت ذخیره شد.',
        'deleted' => 'این آیتم باموفقیت حذف شد.',
        'updated' => 'این آیتم باموفقیت آپدیت شد.',
        'status' => ':item :status با موفقیت'
    ],
    'auth' => [
        'not_verified' => 'کاربر تایید نشده است.',
        'invalid_register_method' => 'روش ثیت نام نامعتبر است.',
        'already_registered' => 'کاربر قبلاٌ ثبت نام کرده است.',
        'login' => 'کاربر باموفقیت وارد سیستم شد.',
        'registered' => 'کاربر باموفقیت ثبت نام کرد.'
    ]

];