<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Forms
    |--------------------------------------------------------------------------
    */

    'maximum_64_characters' => 'حداکثر 64 حرف',
    'maximum_128_characters' => 'حداکثر 128 حرف',
    '50_160_characters_preferred' => 'بین 160-155 حرف ترجیح داده شده است',
    'maximum_50_characters' => 'حداکثر 50 حرف',
    'course_thumbnail_size' => '250×360 پیکسل ترجیح داده شده است',
    'course_cover_size' => '530×1920 پیکسل ترجیح داده شده است',
    'capacity_placeholder' => 'میزبان چند دانشجو خواهید بود؟',
    'subscribe_hint' => 'علاوه بر خرید مستقیم دانش دانشجویان می توانند در محتوای شما عضویت یابند',
    'webinar_description_placeholder' => 'حداقل 300 کلمه. HTML و تصاویر پشتیبانی می شود',
    'empty_means_unlimited' => 'برای تعداد نامحدود خالی بگذارید.',
    'maximum_255_characters' => 'حداکثر 255 حرف',
    'max' => 'حداکثر',

];
