<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Notifications
    |--------------------------------------------------------------------------
    */

    'all_notifications' => 'تمام اعلان‌ها',
    'sender' => 'فرستنده',
    'notifications_page_lists_lead' => 'فهرست اعلان‌ها. میتوانید تنظیم یا حذف کنید.',
    'send_notification' => 'ارسال اعلان',
    'edit_notification' => 'تنظیم اعلان',
    'empty_notifications' => 'اعلان‌های خالی',
    'email_ignore_msg' => 'اگر این درخواست را تایید نکردید، لطفاٌ آن را نادیده بگیرید.',
    'send_noticeboard' => 'یک هشدار جدید ارسال کنید',
    'edit_noticeboard' => 'تنظیم هشدار',
    'post_notice' => 'ارسال هشدار',
    'receiver' => 'دریافت کننده',

];
