<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Authentication & Password
    |--------------------------------------------------------------------------
    |
    |
    */

    'reset' => 'بازیابی رمز عبور با موفقیت انجام شد',
    'sent' => 'لینک بازیابی رمزعبور را به ایمیل شما ارسال کرده ایم!',
    'throttled' => 'لطفاٌ پیش از تلاش مجدد صبر کنید',
    'token' => 'لینک بازیابی رمزعبور نامعتبر است',
    'user' => "کاربری با این آدرس ایمیل پیدا نشد",
];
