app/Http/Controllers/Admin/UserController.php

    public function instructors(Request $request, $is_export_excel = false)
    {
        $this->authorize('admin_instructors_list');

        $query = User::where('role_name', Role::$teacher);

        $totalInstructors = deepClone($query)->count();
        $inactiveInstructors = deepClone($query)->where('status', 'inactive')
            ->count();
        $banInstructors = deepClone($query)->where('ban', true)
            ->whereNotNull('ban_end_at')
            ->where('ban_end_at', '>', time())
            ->count();

        $totalOrganizationsInstructors = User::where('role_name', Role::$teacher)
            ->whereNotNull('organ_id')
            ->count();
        $userGroups = Group::where('status', 'active')
            ->orderBy('created_at', 'desc')
            ->get();

        $organizations = User::select('id', 'full_name', 'created_at')
            ->where('role_name', Role::$organization)
            ->orderBy('created_at', 'desc')
            ->get();
---
select count(*) as aggregate from `users` where `role_name` = 'teacher'
select count(*) as aggregate from `users` where `role_name` = 'teacher' and `status` = 'inactive'
select count(*) as aggregate from `users` where `role_name` = 'teacher' and `ban` = 1 and `ban_end_at` is not null and `ban_end_at` > 1709579705
select count(*) as aggregate from `users` where `role_name` = 'teacher' and `organ_id` is not null
select * from `groups` where `status` = 'active' order by `created_at` desc
select `id`, `full_name`, `created_at` from `users` where `role_name` = 'organization' order by `created_at` desc

    private function addUsersExtraInfo($users)
    {
        foreach ($users as $user) {
            $salesQuery = Sale::where('seller_id', $user->id)
                ->whereNull('refund_at');

            $classesSaleQuery = deepClone($salesQuery)->whereNotNull('webinar_id')
                ->whereNull('meeting_id')
                ->whereNull('promotion_id')
                ->whereNull('subscribe_id');

            $user->classesSalesCount = $classesSaleQuery->count();
            $user->classesSalesSum = $classesSaleQuery->sum('total_amount');

            $meetingIds = Meeting::where('creator_id', $user->id)->pluck('id');
---
select `id` from `meetings` where `creator_id` = 1016

    public function edit(Request $request, $id)
    {
        $this->authorize('admin_users_edit');

        $user = User::where('id', $id)
            ->with([
                'customBadges' => function ($query) {
                    $query->with('badge');
                },
                'occupations' => function ($query) {
                    $query->with('category');
                },
                'organization' => function ($query) {
                    $query->select('id', 'full_name');
                },
                'userRegistrationPackage'
            ])
            ->first();
---
select * from `users_registration_packages` where `users_registration_packages`.`user_id` in (1016)
select `id`, `full_name` from `users` where `users`.`id` in ('')

            }
        }

        $categories = Category::where('parent_id', null)
            ->with('subCategories')
            ->get();
---
select * from `categories` where `parent_id` is null


        $userBadges = $user->getBadges(false);

        $roles = Role::all();
        $badges = Badge::all();
---
select * from `roles`
select * from `badges`

        $cities = null;
        $districts = null;

        $countries = Region::select(DB::raw('*, ST_AsText(geo_center) as geo_center'))
            ->where('type', Region::$country)
            ->get();
---
select *, ST_AsText(geo_center) as geo_center from `regions` where `type` = 'country'

                ->get();
        }

        $userBanks = UserBank::query()
            ->with([
                'specifications'
            ])
            ->orderBy('created_at', 'desc')
            ->get();
---
select * from `user_banks` order by `created_at` desc

    private function getPurchasedClassesData($user)
    {
        $manualAddedClasses = Sale::whereNull('refund_at')
            ->where('buyer_id', $user->id)
            ->whereNotNull('webinar_id')
            ->where('sales.manual_added', true)
            ->where('sales.access_to_purchased_item', true)
            ->whereHas('webinar')
            ->with([
                'webinar'
            ])
            ->orderBy('created_at', 'desc')
            ->get();

        $manualDisabledClasses = Sale::whereNull('refund_at')
            ->where('buyer_id', $user->id)
            ->whereNotNull('webinar_id')
            ->where('sales.access_to_purchased_item', false)
            ->whereHas('webinar')
            ->with([
                'webinar'
            ])
            ->orderBy('created_at', 'desc')
            ->get();

        $purchasedClasses = Sale::whereNull('refund_at')
            ->where('buyer_id', $user->id)
            ->whereNotNull('webinar_id')
            ->where('sales.access_to_purchased_item', true)
            ->where('sales.manual_added', false)
            ->whereHas('webinar')
            ->with([
                'webinar'
            ])
            ->orderBy('created_at', 'desc')
            ->get();
---
select * from `sales` where `refund_at` is null and `buyer_id` = 1016 and `webinar_id` is not null and `sales`.`manual_added` = 1 and `sales`.`access_to_purchased_item` = 1 and exists (select * from `webinars` where `sales`.`webinar_id` = `webinars`.`id`) order by `created_at` desc
select * from `sales` where `refund_at` is null and `buyer_id` = 1016 and `webinar_id` is not null and `sales`.`access_to_purchased_item` = 0 and exists (select * from `webinars` where `sales`.`webinar_id` = `webinars`.`id`) order by `created_at` desc
select * from `sales` where `refund_at` is null and `buyer_id` = 1016 and `webinar_id` is not null and `sales`.`access_to_purchased_item` = 1 and `sales`.`manual_added` = 0 and exists (select * from `webinars` where `sales`.`webinar_id` = `webinars`.`id`) order by `created_at` desc

    private function getPurchasedBundlesData($user)
    {
        $manualAddedBundles = Sale::whereNull('refund_at')
            ->where('buyer_id', $user->id)
            ->whereNotNull('bundle_id')
            ->where('sales.manual_added', true)
            ->where('sales.access_to_purchased_item', true)
            ->whereHas('bundle')
            ->with([
                'bundle'
            ])
            ->orderBy('created_at', 'desc')
            ->get();

        $manualDisabledBundles = Sale::whereNull('refund_at')
            ->where('buyer_id', $user->id)
            ->whereNotNull('bundle_id')
            ->where('sales.access_to_purchased_item', false)
            ->whereHas('bundle')
            ->with([
                'bundle'
            ])
            ->orderBy('created_at', 'desc')
            ->get();

        $purchasedBundles = Sale::whereNull('refund_at')
            ->where('buyer_id', $user->id)
            ->whereNotNull('bundle_id')
            ->where('sales.access_to_purchased_item', true)
            ->where('sales.manual_added', false)
            ->whereHas('bundle')
            ->with([
                'bundle'
            ])
            ->orderBy('created_at', 'desc')
            ->get();
---
select * from `sales` where `refund_at` is null and `buyer_id` = 1016 and `bundle_id` is not null and `sales`.`manual_added` = 1 and `sales`.`access_to_purchased_item` = 1 and exists (select * from `bundles` where `sales`.`bundle_id` = `bundles`.`id`) order by `created_at` desc
select * from `sales` where `refund_at` is null and `buyer_id` = 1016 and `bundle_id` is not null and `sales`.`access_to_purchased_item` = 0 and exists (select * from `bundles` where `sales`.`bundle_id` = `bundles`.`id`) order by `created_at` desc
select * from `sales` where `refund_at` is null and `buyer_id` = 1016 and `bundle_id` is not null and `sales`.`access_to_purchased_item` = 1 and `sales`.`manual_added` = 0 and exists (select * from `bundles` where `sales`.`bundle_id` = `bundles`.`id`) order by `created_at` desc

    private function getPurchasedProductsData($user)
    {
        $manualAddedProducts = Sale::whereNull('refund_at')
            ->where('buyer_id', $user->id)
            ->whereNotNull('product_order_id')
            ->where('sales.manual_added', true)
            ->where('sales.access_to_purchased_item', true)
            ->whereHas('productOrder')
            ->with([
                'productOrder' => function ($query) {
                    $query->with([
                        'product'
                    ]);
                }
            ])
            ->orderBy('created_at', 'desc')
            ->get();

        $manualDisabledProducts = Sale::whereNull('refund_at')
            ->where('buyer_id', $user->id)
            ->whereNotNull('product_order_id')
            ->where('sales.access_to_purchased_item', false)
            ->whereHas('productOrder')
            ->with([
                'productOrder' => function ($query) {
                    $query->with([
                        'product'
                    ]);
                }
            ])
            ->orderBy('created_at', 'desc')
            ->get();

        $purchasedProducts = Sale::whereNull('refund_at')
            ->where('buyer_id', $user->id)
            ->whereNotNull('product_order_id')
            ->where('sales.access_to_purchased_item', true)
            ->where('sales.manual_added', false)
            ->whereHas('productOrder')
            ->with([
                'productOrder' => function ($query) {
                    $query->with([
                        'product'
                    ]);
                }
            ])
            ->orderBy('created_at', 'desc')
            ->get();
---
select * from `sales` where `refund_at` is null and `buyer_id` = 1016 and `product_order_id` is not null and `sales`.`manual_added` = 1 and `sales`.`access_to_purchased_item` = 1 and exists (select * from `product_orders` where `sales`.`product_order_id` = `product_orders`.`id`) order by `created_at` desc
select * from `sales` where `refund_at` is null and `buyer_id` = 1016 and `product_order_id` is not null and `sales`.`access_to_purchased_item` = 0 and exists (select * from `product_orders` where `sales`.`product_order_id` = `product_orders`.`id`) order by `created_at` desc
select * from `sales` where `refund_at` is null and `buyer_id` = 1016 and `product_order_id` is not null and `sales`.`access_to_purchased_item` = 1 and `sales`.`manual_added` = 0 and exists (select * from `product_orders` where `sales`.`product_order_id` = `product_orders`.`id`) order by `created_at` desc